In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(r"D:\Data_Science_Datasets\archive\weather.csv")
df.head()

,MinTemp,MaxTemp,Rainfall,Evaporation,Sunshine,WindGustDir,WindGustSpeed,WindDir9am,WindDir3pm,WindSpeed9am,...,Humidity3pm,Pressure9am,Pressure3pm,Cloud9am,Cloud3pm,Temp9am,Temp3pm,RainToday,RISK_MM,RainTomorrow
0,8.0,24.3,0.0,3.4,6.3,NW,30.0,SW,NW,6.0,...,29,1019.7,1015.0,7,7,14.4,23.6,No,3.6,Yes
1,14.0,26.9,3.6,4.4,9.7,ENE,39.0,E,W,4.0,...,36,1012.4,1008.4,5,3,17.5,25.7,Yes,3.6,Yes
2,13.7,23.4,3.6,5.8,3.3,NW,85.0,N,NNE,6.0,...,69,1009.5,1007.2,8,7,15.4,20.2,Yes,39.8,Yes
3,13.3,15.5,39.8,7.2,9.1,NW,54.0,WNW,W,30.0,...,56,1005.5,1007.0,2,7,13.5,14.1,Yes,2.8,Yes
4,7.6,16.1,2.8,5.6,10.6,SSE,50.0,SSE,ESE,20.0,...,49,1018.3,1018.5,7,7,11.1,15.4,Yes,0.0,No

In [4]:
df["MaxTemp"].max()

35.8

In [5]:
df["MinTemp"][df["RainTomorrow"]=="Yes"]

0       8.0
1      14.0
2      13.7
3      13.3
8       8.8
       ...
326     3.2
337    16.8
338    14.4
340    11.2
347     6.7
Name: MinTemp, Length: 66, dtype: float64

In [6]:
weather_data = {"Day":["1/1/2023", "2/1/2023","3/1/2023", "4/1/2023", "5/1/2023", "6/1/2023"],
                "Temp": [23,25,22,30,38,23],
                "wind Speed": [5,6,8,4,9,5],
                "Event": ["Yes", "Yes", "Yes", "No", "No", "Yes"]}
df = pd.DataFrame(weather_data)
df

        Day  Temp  wind Speed Event
0  1/1/2023    23           5   Yes
1  2/1/2023    25           6   Yes
2  3/1/2023    22           8   Yes
3  4/1/2023    30           4    No
4  5/1/2023    38           9    No
5  6/1/2023    23           5   Yes

In [7]:
rows, columns = df.shape

In [8]:
rows

6

In [9]:
columns

4

In [10]:
df.head(2)

        Day  Temp  wind Speed Event
0  1/1/2023    23           5   Yes
1  2/1/2023    25           6   Yes

In [11]:
df.tail(2)

        Day  Temp  wind Speed Event
4  5/1/2023    38           9    No
5  6/1/2023    23           5   Yes

In [12]:
df[2:5]

        Day  Temp  wind Speed Event
2  3/1/2023    22           8   Yes
3  4/1/2023    30           4    No
4  5/1/2023    38           9    No

In [13]:
df.columns

Index(['Day', 'Temp', 'wind Speed', 'Event'], dtype='object')

In [14]:
df.Day

0    1/1/2023
1    2/1/2023
2    3/1/2023
3    4/1/2023
4    5/1/2023
5    6/1/2023
Name: Day, dtype: object

In [15]:
df.Event

0    Yes
1    Yes
2    Yes
3     No
4     No
5    Yes
Name: Event, dtype: object

In [16]:
df["Event"]

0    Yes
1    Yes
2    Yes
3     No
4     No
5    Yes
Name: Event, dtype: object

In [17]:
type(df["Event"])

pandas.core.series.Series

In [18]:
df[["Day", "Event"]]

        Day Event
0  1/1/2023   Yes
1  2/1/2023   Yes
2  3/1/2023   Yes
3  4/1/2023    No
4  5/1/2023    No
5  6/1/2023   Yes

In [19]:
 df["Temp"].max()

38

In [20]:
 df["Temp"].min()

22

In [21]:
 df["Temp"].sum()

161

In [22]:
 df["Temp"].count()

6

In [23]:
 df["Temp"].std()

6.177917664283546

In [24]:
df.describe()

            Temp  wind Speed
count   6.000000    6.000000
mean   26.833333    6.166667
std     6.177918    1.940790
min    22.000000    4.000000
25%    23.000000    5.000000
50%    24.000000    5.500000
75%    28.750000    7.500000
max    38.000000    9.000000

In [25]:
df[df.Temp>=25]

        Day  Temp  wind Speed Event
1  2/1/2023    25           6   Yes
3  4/1/2023    30           4    No
4  5/1/2023    38           9    No

In [26]:
df[df.Temp==df["Temp"].max()]

        Day  Temp  wind Speed Event
4  5/1/2023    38           9    No

In [27]:
df[["Day", "Temp"]][df.Temp==df["Temp"].max()]

        Day  Temp
4  5/1/2023    38

In [28]:
df

        Day  Temp  wind Speed Event
0  1/1/2023    23           5   Yes
1  2/1/2023    25           6   Yes
2  3/1/2023    22           8   Yes
3  4/1/2023    30           4    No
4  5/1/2023    38           9    No
5  6/1/2023    23           5   Yes

In [36]:
import pandas as pd
df = pd.read_csv("D:\Data_Science_Datasets\Excel_with_Python1.csv")
df

  tickers            eps  revenue   price         people  Unnamed: 5
0   GOOGL          27.82     87.0   845.0     larry page         NaN
1     WMT           4.61    484.0    65.0     Sam Walton         NaN
2    MSFT             -1     85.0    64.0     bill gates         NaN
3    RIL   not available     50.0  1023.0  mukesh ambani         NaN
4    TATA            5.6     -1.0    50.0     ratan tata         NaN
5   BAJAJ            NaN      NaN     NaN            NaN         NaN

In [37]:
import pandas as pd
df = pd.read_csv("D:\Data_Science_Datasets\Excel_with_Python1.csv", header = None)
df

         0              1        2      3              4   5
0  tickers            eps  revenue  price         people NaN
1    GOOGL          27.82       87    845     larry page NaN
2      WMT           4.61      484     65     Sam Walton NaN
3     MSFT             -1       85     64     bill gates NaN
4     RIL   not available       50   1023  mukesh ambani NaN
5     TATA            5.6       -1     50     ratan tata NaN
6    BAJAJ            NaN      NaN    NaN            NaN NaN

In [42]:
import pandas as pd
df = pd.read_csv("D:\Data_Science_Datasets\Excel_with_Python1.csv", header = None, names = ["Ticker", "EPS", "Revenue", "Price", "People"])
df

                Ticker      EPS Revenue          Price  People
tickers            eps  revenue   price         people     NaN
GOOGL            27.82       87     845     larry page     NaN
WMT               4.61      484      65     Sam Walton     NaN
MSFT                -1       85      64     bill gates     NaN
RIL      not available       50    1023  mukesh ambani     NaN
TATA               5.6       -1      50     ratan tata     NaN
BAJAJ              NaN      NaN     NaN            NaN     NaN

In [44]:
import pandas as pd
df = pd.read_csv("D:\Data_Science_Datasets\Excel_with_Python1.csv", na_values = ["not available", "n.a."])
df

  tickers    eps  revenue   price         people  Unnamed: 5
0   GOOGL  27.82     87.0   845.0     larry page         NaN
1     WMT   4.61    484.0    65.0     Sam Walton         NaN
2    MSFT  -1.00     85.0    64.0     bill gates         NaN
3    RIL     NaN     50.0  1023.0  mukesh ambani         NaN
4    TATA   5.60     -1.0    50.0     ratan tata         NaN
5   BAJAJ    NaN      NaN     NaN            NaN         NaN